{
  "backend/main.mo": "Main Motoko actor implementing a book library platform with user roles, book management, reading progress tracking, ratings, recommendations, bookmarks, and admin approval workflows using Map-based storage and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented mobile-first responsive design features including hamburger navigation, touch-friendly interactive elements, responsive layouts for all pages, and proper screen size handling down to 320px width.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing component functionality, responsive design implementations, authentication flows, and Van Gogh theming with OKLCH color system.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH-based Van Gogh color tokens for light/dark themes, custom CSS variables for UI components, and base styling for body and border elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag and page title 'THE HOUSE OF VIGILANTES', loading the React app via main.tsx script.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (landing, browse, admin, author, social, collections, trending, user management), QueryClient provider, theme provider, and nested layout structure with authenticated and public routes.",
  "frontend/src/components/AppLayout.tsx": "Authenticated layout wrapper that redirects unauthenticated users to landing page, renders Navigation and collapsible Sidebar, and applies responsive margin to main content area based on sidebar state.",
  "frontend/src/components/AuthorAnalytics.tsx": "Displays analytics dashboard for an author's selected book, showing mock metrics like views, reads, favorites, ratings, and revenue with stat cards and charts. Verifies book ownership before displaying analytics.",
  "frontend/src/components/AuthorBookManager.tsx": "Manages an author's book collection with CRUD operations, displaying books in a grid with edit, delete, and analytics actions. Includes a BookForm dialog for adding/editing books and confirmation dialogs for deletion.",
  "frontend/src/components/AuthorReaderInteraction.tsx": "Shows mock reader comments and top fans for an author's books with UI for replying to comments and viewing fan engagement metrics. Uses placeholder data until real comment system is integrated.",
  "frontend/src/components/AuthorSeriesManager.tsx": "Frontend-only component for managing book series with create, edit, and delete operations, allowing authors to group books and define reading order. Uses local state until backend series support is added.",
  "frontend/src/components/AuthPrompt.tsx": "Modal dialog component prompting unauthenticated users to log in with customizable message, featuring Van Gogh-themed styling, lock icon, LoginButton integration, and cancel option.",
  "frontend/src/components/BookCarousel.tsx": "Renders a horizontally scrollable carousel of book covers with navigation arrows, handling loading states and empty states. Navigates to book detail page on click.",
  "frontend/src/components/BookForm.tsx": "Form dialog for creating, editing, or submitting books with fields for metadata (title, author, genre, etc.) and PDF upload functionality. Validates inputs and handles file uploads with drag-and-drop support.",
  "frontend/src/components/BookGrid.tsx": "Displays a responsive grid of book cards with cover images, ratings, bookmark indicators, and approval status badges for admins. Includes loading skeletons and empty state handling.",
  "frontend/src/components/DashboardStatsCard.tsx": "Renders a styled card component for displaying dashboard statistics with an icon, label, value, and optional trend indicator.",
  "frontend/src/components/DeleteAccountModal.tsx": "Modal dialog for confirming account deletion with warning icon, descriptive text, and cancel/confirm buttons with loading state support.",
  "frontend/src/components/EditAuthorProfileDialog.tsx": "Dialog form for authors to edit their profile including name, bio, website, and social media links with URL validation and localStorage persistence for extended fields.",
  "frontend/src/components/EditProfileDialog.tsx": "Simple dialog form for users to edit their profile name while preserving author status, with mutation handling and toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information and a \"Built with caffeine.ai\" attribution link with dynamic year and app identifier.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with gradient background, heading, description, and search input form for discovering books by title, author, or genre.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, with loading states and query cache clearing on logout.",
  "frontend/src/components/MoodCarousel.tsx": "Wrapper component that maps mood strings to book genres and displays a carousel of books matching that genre using BookCarousel.",
  "frontend/src/components/MoodFilterChips.tsx": "Displays a collection of mood filter chips with emojis that users can toggle to filter content, including a clear all button when filters are active.",
  "frontend/src/components/Navigation.tsx": "Main navigation bar component with responsive mobile menu, authentication-aware nav items (Home, Browse, Trending, Authors, Upload, Profile), and includes login button, theme toggle, and role badge.",
  "frontend/src/components/PdfViewer.tsx": "PDF viewer component with embedded iframe display and action buttons for downloading and opening PDFs in a new tab.",
  "frontend/src/components/PlaceholderAuthDialog.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and creates a new user profile with default non-author status.",
  "frontend/src/components/RecommendationCard.tsx": "Card component displaying a recommended book with cover image, title, author, recommendation reason, and a \"For You\" badge with sparkle icon.",
  "frontend/src/components/RequestMoreEditsDialog.tsx": "Dialog for requesting additional edit permissions when a user has exhausted their allowed edits for a book, with optional message field.",
  "frontend/src/components/RoleBadge.tsx": "Displays user role badge (Admin, Author, or User) with appropriate icons and styling based on system role and author status.",
  "frontend/src/components/Sidebar.tsx": "Collapsible sidebar navigation with main nav items and admin-specific items, filtered by authentication and role permissions, with active route highlighting.",
  "frontend/src/components/StarRating.tsx": "Star rating display and input component with configurable size, optional interactivity for rating selection, and optional rating count display.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button that switches between light and dark modes using next-themes, with animated sun/moon icons.",
  "frontend/src/components/TrendingSection.tsx": "Displays a ranked list of trending books with cover images, ratings, and metadata. Includes loading skeletons and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/useMoodFilter.ts": "Manages mood-based filtering state, allowing users to toggle moods and derive corresponding book genres from selected moods.",
  "frontend/src/hooks/usePdfUpload.ts": "Handles PDF file upload with validation (1GB max), drag-and-drop support, file processing to Uint8Array, and progress tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including user profiles, roles, books, ratings, recommendations, and admin functions with proper cache invalidation.",
  "frontend/src/hooks/useSidebarState.ts": "Manages sidebar collapsed/expanded state with localStorage persistence for user preference across sessions.",
  "frontend/src/index.css": "Defines Van Gogh-inspired color scheme using OKLCH color space for light/dark modes, responsive typography, custom scrollbars, and utility animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard displaying site-wide statistics including total/approved books, genre distribution, and top 10 trending books with charts and metrics.",
  "frontend/src/pages/AdminCollectionsPage.tsx": "Admin-only page for managing curated book collections, currently showing a placeholder indicating backend support is being implemented.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin-only content moderation page with placeholder UI indicating backend support for reviewing user-generated content is being implemented.",
  "frontend/src/pages/AdminPage.tsx": "Main admin panel for managing all books with edit/delete functionality, approval status badges, and role-based access control requiring admin privileges.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin page for reviewing pending book submissions with approve/reject actions and optional rejection reason dialog.",
  "frontend/src/pages/AuthorDashboardPage.tsx": "Author dashboard with tabbed interface for managing books, viewing analytics, managing series, reader interactions, profile editing, and account deletion functionality.",
  "frontend/src/pages/AuthorProfilePage.tsx": "Displays an individual author's profile page with their bio, follower count, and a grid of their approved books. Includes navigation back to authors list and conditional rendering for authenticated users.",
  "frontend/src/pages/AuthorsPage.tsx": "Lists all authors with their book counts, extracted from approved books in the system. Displays authors in a grid with skeleton loading states and handles navigation to browse page on author click.",
  "frontend/src/pages/BookDetailPage.tsx": "Shows detailed book information including PDF viewer, star ratings, bookmarking, and placeholder reviews. Handles authentication prompts for protected actions like rating and bookmarking.",
  "frontend/src/pages/BrowseBooksPage.tsx": "Main book browsing page with hero section and filtering by mood, genre, and author. Uses memoized filtering logic to display books in a grid based on selected criteria.",
  "frontend/src/pages/CollectionDetailPage.tsx": "Placeholder page for collection details with share buttons and navigation back to collections list. Displays a coming soon message indicating backend implementation is pending.",
  "frontend/src/pages/CollectionsPage.tsx": "Placeholder page for curated book collections feature. Shows a coming soon message with icon indicating the backend support is under development.",
  "frontend/src/pages/DiscussionsPage.tsx": "Placeholder page for book discussion threads feature. Displays a coming soon message indicating backend support for discussions is being implemented.",
  "frontend/src/pages/FavoritesPage.tsx": "Displays the user's bookmarked/favorite books in a grid layout with authentication checks. Shows a login prompt for unauthenticated users and handles loading/error states with skeleton loaders.",
  "frontend/src/pages/HomePage.tsx": "Landing page component that displays a themed background image with title and tagline. Redirects authenticated users to '/home' and shows login button for unauthenticated users.",
  "frontend/src/pages/LandingPage.tsx": "Alternative landing page with Van Gogh-themed backgrounds, theme toggle, and login functionality. Automatically redirects authenticated users to '/home'.",
  "frontend/src/pages/MyBooksPage.tsx": "Manages user-uploaded books with edit, delete, and request-more-edits functionality. Requires authentication and displays books in cards with status badges and action buttons.",
  "frontend/src/pages/PersonalizedHomePage.tsx": "Displays personalized book recommendations, trending books, and mood-based genre sections using carousels. Fetches data for multiple genres and shows loading skeletons during data fetch.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing reading statistics, genre preferences, and account management options. Includes edit profile, logout, and delete account functionality with authentication checks.",
  "frontend/src/pages/SocialPage.tsx": "Displays a placeholder page for social features with authentication check; shows login prompt for unauthenticated users and a 'coming soon' message for authenticated users.",
  "frontend/src/pages/ThreadDetailPage.tsx": "Renders a placeholder page for discussion thread details with a back button to discussions list and a 'coming soon' message.",
  "frontend/src/pages/TrendingPage.tsx": "Displays trending and popular books with sections for top trending, popular moods, and genre-based trending; uses real backend queries and calculates mood distribution from genre data.",
  "frontend/src/pages/UploadBookPage.tsx": "Provides a book upload interface with submission guidelines, authentication check, and a form for submitting books; handles authentication prompts and book submission via backend mutation.",
  "frontend/src/pages/UserManagementPage.tsx": "Super admin-only page for managing user roles (co-admin and author promotion); checks caller role and displays placeholder UI as backend user listing is not yet implemented.",
  "frontend/src/utils/mockAnalyticsData.ts": "Generates consistent mock analytics data (views, reads, favorites, trends, progress distribution) for books based on ISBN seed for development purposes.",
  "frontend/src/utils/mockBookData.ts": "Deprecated file containing mock book data structures; includes deprecation notice directing developers to use real backend query hooks instead.",
  "frontend/src/utils/mockReaderData.ts": "Provides mock reader engagement data including comments and top fans with engagement scores for development and testing purposes.",
  "frontend/src/utils/moodMappings.ts": "Defines mood-to-genre mappings and utility functions for converting moods to genres, getting all moods, and retrieving mood emojis.",
  "frontend/src/utils/pdfThumbnail.ts": "Placeholder function for PDF thumbnail generation that currently returns null; intended for future PDF.js integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard query strings and hash-based routing. Includes functions to persist parameters across navigation and clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space (including Van Gogh-themed colors), extended spacing, custom fonts (Inter and Crimson Text), and plugins for animations and typography.",
  "project_state.json": "Project metadata defining a digital library platform with Internet Identity authentication, admin-approved book uploads, PDF reading capabilities, and mobile-first responsive design. Tracks implemented features including responsive navigation, touch-friendly UI elements, and responsive layouts for all major pages."
}