{
  "backend/main.mo": "Main Motoko actor implementing a book library system with user authentication, book management (CRUD, approval workflow), reading progress tracking, ratings, recommendations, bookmarks, and admin controls including account deletion.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including sidebar navigation, Van Gogh-themed styling, home page, books browse page, and authors list page with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, styling, hooks, components, and pages with Van Gogh theming, authentication, book management, and admin functionality.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color variables for light/dark modes, sidebar theming, and chart colors using CSS custom properties.",
  "frontend/index.html": "HTML entry point with page title \"THE HOUSE OF VIGILANTES\" and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining all routes (landing, browse, admin, trending, authors, collections, social, etc.) with authenticated and public layouts, QueryClient, and ThemeProvider setup.",
  "frontend/src/components/AppLayout.tsx": "Authenticated app layout wrapper with collapsible sidebar, header with mobile menu toggle, logout button, theme toggle, and footer, managing sidebar state and logout flow with smooth transitions.",
  "frontend/src/components/AuthorAnalytics.tsx": "Displays analytics dashboard for a selected book including views, reads, favorites, ratings, completion rate, and engagement trends. Uses mock data and shows placeholder when no book is selected.",
  "frontend/src/components/AuthorBookManager.tsx": "Manages author's book collection with CRUD operations (add, edit, delete) and navigation to analytics. Displays books in a grid with action buttons and includes confirmation dialogs.",
  "frontend/src/components/AuthorReaderInteraction.tsx": "Shows reader comments/feedback and top fans for an author's books using mock data. Includes UI for replying to comments and viewing fan engagement metrics.",
  "frontend/src/components/AuthorSeriesManager.tsx": "Frontend-only component for creating and managing book series with reading order. Uses local state until backend series support is implemented.",
  "frontend/src/components/AuthPrompt.tsx": "Modal dialog component prompting unauthenticated users to log in with Internet Identity, featuring Van Gogh-themed styling and a lock icon.",
  "frontend/src/components/BookCarousel.tsx": "Horizontal scrollable carousel for displaying books with navigation arrows, loading states, and click-to-navigate functionality. Shows book covers, titles, authors, and genre badges.",
  "frontend/src/components/BookForm.tsx": "A dialog form component for creating, editing, or submitting books with fields for title, author, cover image, description, genre, ISBN, page count, and PDF upload. Includes validation, PDF file handling via usePdfUpload hook, and toast notifications for success/error states.",
  "frontend/src/components/BookGrid.tsx": "Displays a responsive grid of book cards with cover images, titles, authors, genres, ratings, and bookmark/approval status indicators. Each card links to the book detail page and shows hover effects with Van Gogh-themed styling.",
  "frontend/src/components/DashboardStatsCard.tsx": "A reusable card component for displaying dashboard statistics with an icon, label, value, and optional trend indicator. Features Van Gogh-themed styling with hover effects.",
  "frontend/src/components/DeleteAccountModal.tsx": "A confirmation modal for account deletion with warning icon, descriptive text about permanent data loss, and cancel/confirm action buttons. Includes loading state during deletion.",
  "frontend/src/components/EditAuthorProfileDialog.tsx": "A dialog form for authors to edit their profile including name/pen name, bio, website, and social media links (Twitter, Facebook, Instagram). Validates URLs and stores extended profile data in localStorage while saving name to backend.",
  "frontend/src/components/EditProfileDialog.tsx": "A simple dialog form for users to edit their profile name. Validates input and uses the useSaveCallerUserProfile mutation to persist changes with toast notifications.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information and a \"Built with caffeine.ai\" attribution link with UTM tracking parameters based on the current hostname.",
  "frontend/src/components/HeroSection.tsx": "A hero section with gradient background, welcome heading, and a search bar for finding books, authors, or genres. Features Van Gogh-themed styling with texture and glow effects.",
  "frontend/src/components/LoginButton.tsx": "A button component that toggles between login and logout states using Internet Identity authentication. Handles loading states, clears query cache on logout, and manages authentication errors.",
  "frontend/src/components/MoodCarousel.tsx": "A horizontal scrollable carousel component that displays books filtered by mood, with navigation arrows, hover effects, and click handlers for individual books.",
  "frontend/src/components/MoodFilterChips.tsx": "Renders a set of clickable mood filter badges with emojis that toggle selection state for filtering books by mood.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar with logo, main navigation links, login button, and responsive mobile menu that collapses on smaller screens.",
  "frontend/src/components/PdfViewer.tsx": "Displays a PDF document in an iframe with options to download or open in a new tab, handling download errors with toast notifications.",
  "frontend/src/components/PlaceholderAuthDialog.tsx": "Empty placeholder component file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, automatically showing on first login.",
  "frontend/src/components/RecommendationCard.tsx": "Card component displaying a recommended book with cover image, title, author, and personalized recommendation reason, linking to the book detail page.",
  "frontend/src/components/RequestMoreEditsDialog.tsx": "Dialog for users to request additional edit permissions for a book after exhausting their edit quota, with optional message field.",
  "frontend/src/components/Sidebar.tsx": "Collapsible sidebar navigation with main and admin menu items, responsive mobile overlay, and authentication-based visibility for certain routes.",
  "frontend/src/components/StarRating.tsx": "A reusable star rating component that displays 1-5 stars with optional interactivity, hover effects, and rating count display. Supports three sizes (sm/md/lg) and can trigger onChange callbacks when clicked.",
  "frontend/src/components/ThemeToggle.tsx": "A fixed-position theme toggle button that switches between light and dark modes using next-themes. Persists theme preference to localStorage and displays sun/moon icons with Van Gogh-themed styling.",
  "frontend/src/components/TrendingSection.tsx": "Displays a ranked list of trending books with cover images, ratings, and metadata in card format. Each book card shows rank badge, cover, title, author, description, genre, and mock rating data.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides login status tracking and identity persistence across page reloads.",
  "frontend/src/hooks/useMoodFilter.ts": "Hook for managing mood-based book filtering, allowing selection/deselection of multiple moods and deriving corresponding book genres. Provides toggleMood, clearMoods functions and computed genresFromMoods array.",
  "frontend/src/hooks/usePdfUpload.ts": "Hook for handling PDF file uploads with validation (PDF format, 1GB max size), drag-and-drop support, and file processing to Uint8Array. Manages upload state including progress, errors, and file metadata with formatting utilities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including user profiles, books (CRUD, filtering by genre/author/trending), ratings, recommendations, and admin functions. Provides both query and mutation hooks with automatic cache invalidation.",
  "frontend/src/hooks/useSidebarState.ts": "Hook for managing sidebar collapsed/expanded state with localStorage persistence. Provides isCollapsed boolean and toggle function to control sidebar visibility across page reloads.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with Van Gogh-inspired color palettes for light and dark modes, custom CSS variables, and keyframe animations (swirl, pulse, float, fade, slide) for UI effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard displaying site-wide metrics (total books, users, active users), top 10 most viewed books, and genre distribution with access control redirecting non-admins to home.",
  "frontend/src/pages/AdminCollectionsPage.tsx": "Admin-only page for managing curated book collections with access control; currently displays a placeholder indicating the feature is under development.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin-only content moderation page with access control; currently displays a placeholder indicating the moderation feature for flagged content is under development.",
  "frontend/src/pages/AdminPage.tsx": "Main admin panel for managing all books with edit and delete functionality, displaying approval status badges, and requiring admin authentication with appropriate access control.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin-only page for reviewing pending book submissions with approve/reject actions, including a dialog for entering rejection reasons and access control for non-admin users.",
  "frontend/src/pages/AuthorDashboardPage.tsx": "Author dashboard page with tabs for profile editing, book management, analytics, series management, and reader interactions. Includes authentication checks, account deletion, and displays dashboard stats for authenticated authors.",
  "frontend/src/pages/AuthorProfilePage.tsx": "Public author profile page displaying author information, follower count, and a grid of their approved books. Filters books by author name and checks if the current user is viewing their own profile.",
  "frontend/src/pages/AuthorsPage.tsx": "Lists all authors with their book counts, extracted from approved books. Displays authors in a grid with skeleton loading states and error handling.",
  "frontend/src/pages/BookDetailPage.tsx": "Detailed book view page with PDF viewer, rating system, bookmarking, sharing options, and placeholder reviews. Tracks book views and manages reading progress for authenticated users.",
  "frontend/src/pages/BrowseBooksPage.tsx": "Book browsing page with mood-based filtering, genre and author dropdowns, and a grid display of approved books. Includes filter chips and clear-all functionality.",
  "frontend/src/pages/CollectionDetailPage.tsx": "Placeholder page for collection details with share buttons and a message indicating backend support is being implemented.",
  "frontend/src/pages/CollectionsPage.tsx": "Displays a placeholder page for curated book collections feature with a \"coming soon\" message indicating backend support is being implemented.",
  "frontend/src/pages/DiscussionsPage.tsx": "Displays a placeholder page for book discussions feature with a \"coming soon\" message indicating backend support for discussion threads is being implemented.",
  "frontend/src/pages/FavoritesPage.tsx": "Shows authenticated user's bookmarked/favorite books in a grid layout with authentication prompt for non-logged-in users. Handles loading states, errors, and empty states with links to browse books.",
  "frontend/src/pages/HomePage.tsx": "Landing page for unauthenticated users featuring Van Gogh-inspired background with theme toggle, website branding, and Internet Identity login button. Redirects authenticated users to /home.",
  "frontend/src/pages/LandingPage.tsx": "Alternative landing page with full-screen Van Gogh background, theme toggle, and login functionality that redirects authenticated users to /home. Features \"The House of Vigilantes\" branding.",
  "frontend/src/pages/MyBooksPage.tsx": "Allows authenticated users to view, edit, delete, and request more edits for their uploaded books. Displays book approval status with badges and handles authentication requirements.",
  "frontend/src/pages/PersonalizedHomePage.tsx": "Main authenticated home page displaying personalized recommendations, continue reading, recently viewed books, mood-based carousels (Happy, Melancholic, Adventurous, etc.), and trending books. Redirects unauthenticated users to landing page.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying user info, reading statistics (books read, bookmarks, ratings), genre preferences, and account management (edit profile, logout, delete account). Requires authentication and shows AuthPrompt if not logged in.",
  "frontend/src/pages/SocialPage.tsx": "Placeholder page for social features (following authors, connecting with readers) that requires authentication. Shows coming soon message indicating backend support is being implemented.",
  "frontend/src/pages/ThreadDetailPage.tsx": "Placeholder page for discussion thread details with back navigation to discussions list. Shows coming soon message for backend implementation.",
  "frontend/src/pages/TrendingPage.tsx": "Displays trending and popular books with hero section, trending books list, top-rated books, books grouped by genre, and mood-based book recommendations using predefined mood categories.",
  "frontend/src/pages/UploadBookPage.tsx": "Book upload page with submission guidelines and BookForm component. Requires authentication and handles book submission via useSubmitBook hook with approval workflow.",
  "frontend/src/utils/mockAnalyticsData.ts": "Generates consistent mock analytics data (views, reads, favorites, completion rate, trends, progress distribution) for books based on ISBN seed for deterministic randomization.",
  "frontend/src/utils/mockBookData.ts": "Provides mock book data organized by mood categories (Happy, Melancholic, Adventurous) with generated cover images and complete Book type properties for testing and development.",
  "frontend/src/utils/mockReaderData.ts": "Provides mock reader engagement data including comments with timestamps and top fans with engagement metrics (reads, ratings, comments, engagement score) for author dashboard features.",
  "frontend/src/utils/moodMappings.ts": "Defines mood types and maps each mood to relevant book genres, with utility functions to retrieve all moods, get genres for selected moods, and display mood emojis.",
  "frontend/src/utils/pdfThumbnail.ts": "Placeholder function for PDF thumbnail generation that currently returns null; intended for future PDF.js integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space (including Van Gogh-inspired colors), extended spacing, custom shadows, font families, and plugins for animations and typography.",
  "project_state.json": "Project state document describing a three-stage book platform development with Van Gogh-inspired blue/gold/white theme, collapsible sidebar navigation, and current Stage 1 UI implementation using placeholder data."
}