{
  "backend/main.mo": "Main Motoko actor implementing a book management system with user roles, book submissions, reading progress tracking, ratings, bookmarks, and account deletion functionality. Includes authorization mixins, blob storage, and approval workflows for book submissions.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Van Gogh-inspired landing page, routing updates, theme persistence, logout flow, and account deletion flow with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the Van Gogh-themed book platform with authentication, book management, and user features.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system for light/dark themes, Van Gogh-inspired color variables, and custom animations including fade-out transitions for logout and account deletion.",
  "frontend/index.html": "HTML entry point with page title 'THE HOUSE OF VIGILANTES' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration, ThemeProvider with localStorage persistence, and route definitions for landing page, authenticated pages, and admin pages.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with sidebar, header containing theme toggle and logout button, and smooth fade transition on logout that redirects to landing page after clearing authentication and query cache.",
  "frontend/src/components/AuthorAnalytics.tsx": "Displays analytics dashboard for a selected book including views, reads, favorites, ratings, completion rate, and trending position with mock data. Shows engagement trends chart and empty state when no book is selected.",
  "frontend/src/components/AuthorBookManager.tsx": "Manages author's book collection with CRUD operations (add, edit, delete, view analytics). Displays books in a grid with action buttons and includes BookForm dialog and delete confirmation.",
  "frontend/src/components/AuthorReaderInteraction.tsx": "Shows reader comments/feedback and top fans section for authors using mock data. Includes reply and mark-as-read functionality for comments and displays fan engagement metrics.",
  "frontend/src/components/AuthorSeriesManager.tsx": "Frontend-only series management component allowing authors to create, edit, and delete book series with reading order. Uses local state until backend series support is implemented.",
  "frontend/src/components/AuthPrompt.tsx": "Modal dialog component prompting unauthenticated users to log in with Internet Identity, featuring Van Gogh-themed styling and a lock icon.",
  "frontend/src/components/BookCarousel.tsx": "Horizontal scrollable carousel component displaying books with navigation arrows, cover images, genre badges, and click-to-navigate functionality. Includes loading skeleton and empty states.",
  "frontend/src/components/BookForm.tsx": "A dialog form component for creating, editing, or submitting books with fields for title, author, cover image, description, genre, ISBN, page count, and PDF upload. Includes validation, PDF file handling via usePdfUpload hook, and toast notifications for success/error states.",
  "frontend/src/components/BookGrid.tsx": "Displays a responsive grid of book cards with cover images, titles, authors, genres, ratings, and bookmark indicators. Shows admin-specific approval status badges and handles empty states.",
  "frontend/src/components/DashboardStatsCard.tsx": "A reusable card component for displaying dashboard statistics with an icon, label, value, and optional trend indicator. Features Van Gogh-themed styling with hover effects.",
  "frontend/src/components/DeleteAccountModal.tsx": "A confirmation modal for account deletion with warning icon, descriptive text about permanent data loss, and cancel/confirm action buttons. Includes loading state during deletion.",
  "frontend/src/components/EditAuthorProfileDialog.tsx": "A dialog form for authors to edit their profile including name/pen name, bio, website, and social media links (Twitter, Facebook, Instagram). Validates URLs and stores extended profile data in localStorage.",
  "frontend/src/components/EditProfileDialog.tsx": "A simple dialog form for users to edit their profile name. Uses the useSaveCallerUserProfile mutation and displays toast notifications for success/error states.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information and a \"Built with caffeine.ai\" attribution link with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "A hero section with gradient background, welcome heading, and a search bar for finding books, authors, or genres. Features Van Gogh-themed styling with texture and glow effects.",
  "frontend/src/components/LoginButton.tsx": "A button component that toggles between login and logout states using Internet Identity authentication. Shows loading spinner during authentication and handles login errors with retry logic.",
  "frontend/src/components/MoodCarousel.tsx": "A horizontal scrollable carousel component that displays books filtered by mood, with navigation arrows, hover effects, and click handlers for individual books.",
  "frontend/src/components/MoodFilterChips.tsx": "Renders a set of clickable mood filter badges with emojis that toggle selection state for filtering books by mood.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar with logo, main navigation links, login button, and responsive mobile menu that collapses on smaller screens.",
  "frontend/src/components/PdfViewer.tsx": "Displays a PDF document in an iframe with download and open-in-new-tab functionality, including error handling and loading states.",
  "frontend/src/components/PlaceholderAuthDialog.tsx": "Empty placeholder component file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, automatically showing on first login.",
  "frontend/src/components/RecommendationCard.tsx": "Card component displaying a recommended book with cover image, title, author, and personalized recommendation reason, linking to the book detail page.",
  "frontend/src/components/RequestMoreEditsDialog.tsx": "Dialog for users to request additional edit permissions for a book after exhausting their edit quota, with optional message field.",
  "frontend/src/components/Sidebar.tsx": "Collapsible left sidebar navigation with icons and labels for main app sections, filtering items based on authentication status and highlighting active routes.",
  "frontend/src/components/StarRating.tsx": "A reusable star rating component that displays 1-5 stars with support for interactive rating selection, hover effects, and optional rating count display.",
  "frontend/src/components/ThemeToggle.tsx": "A theme toggle button component that switches between light and dark modes using next-themes, persists preference to localStorage, and displays sun/moon icons.",
  "frontend/src/components/TrendingSection.tsx": "Displays a list of trending books with rankings, cover images, ratings, and genre badges in a card layout with hover effects.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with Internet Identity authentication, handles admin token initialization, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, identity management, and authentication status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useMoodFilter.ts": "Custom hook for managing mood-based book filtering, allowing users to select/deselect moods and automatically mapping them to corresponding book genres.",
  "frontend/src/hooks/usePdfUpload.ts": "Manages PDF file upload state including validation (file type, 1GB size limit), drag-and-drop handling, file processing to Uint8Array, and progress tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including fetching books, user profiles, submissions, ratings, reading progress, and mutations for creating/updating/deleting data with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with Van Gogh-inspired color palettes for light and dark modes, custom animations (swirl, pulse, float, fade), and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page for managing books with authentication checks, displaying all books with edit/delete actions, approval status badges, and a book form dialog for updates.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin review interface for approving or rejecting pending book submissions with authentication checks, displaying submission cards, and a rejection reason dialog.",
  "frontend/src/pages/AuthorDashboardPage.tsx": "Author dashboard with tabs for profile management, book management, analytics, series management, and reader interaction, plus account deletion functionality with authentication prompts for guests.",
  "frontend/src/pages/AuthorProfilePage.tsx": "Public author profile page displaying author information, bio, social links, and a grid of books by that author fetched from the backend.",
  "frontend/src/pages/AuthorsPage.tsx": "Displays a paginated list of authors extracted from approved books, showing each author's name, book count, and books. Clicking an author navigates to the browse page.",
  "frontend/src/pages/BookDetailPage.tsx": "Shows detailed book information including metadata, PDF viewer, reading progress tracking, bookmarking, and star ratings. Prompts unauthenticated users to log in for interactive features.",
  "frontend/src/pages/BrowseBooksPage.tsx": "Provides a filterable book browsing interface with mood-based genre filtering, genre dropdown, and author dropdown. Displays filtered books in a grid layout.",
  "frontend/src/pages/FavoritesPage.tsx": "Displays the authenticated user's bookmarked books in a grid. Shows a login prompt for unauthenticated users.",
  "frontend/src/pages/HomePage.tsx": "Landing page for unauthenticated users with Van Gogh-themed background, site branding, and Internet Identity login button. Redirects authenticated users to /home.",
  "frontend/src/pages/LandingPage.tsx": "Alternative landing page with full-screen Van Gogh background, theme toggle, and Internet Identity login. Redirects authenticated users to /home.",
  "frontend/src/pages/MyBooksPage.tsx": "Displays authenticated user's uploaded books with edit, delete, and request-more-edits functionality; shows auth prompt for unauthenticated users and uses BookForm dialog for editing.",
  "frontend/src/pages/PersonalizedHomePage.tsx": "Main landing page featuring a hero section with search, mood-based book carousels (Happy, Melancholic, Adventurous, Calm, Inspiring, Suspenseful), and a trending books section.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing reading statistics, bookmarked books, genre preferences, and edit profile functionality; requires authentication and displays auth prompt for guests.",
  "frontend/src/pages/UploadBookPage.tsx": "Book upload page with submission guidelines and BookForm dialog; requires authentication and shows auth prompt for unauthenticated users attempting to upload.",
  "frontend/src/utils/mockAnalyticsData.ts": "Generates consistent mock analytics data (views, reads, favorites, completion rate, trends, progress distribution) for books based on ISBN seed.",
  "frontend/src/utils/mockBookData.ts": "Provides mock book data organized by mood categories (Happy, Melancholic, Adventurous) with generated cover images and complete book metadata.",
  "frontend/src/utils/mockReaderData.ts": "Provides mock reader engagement data including comments and top fans with engagement scores for testing purposes.",
  "frontend/src/utils/moodMappings.ts": "Defines mood-to-genre mappings and utility functions for converting moods to genres and retrieving mood emojis.",
  "frontend/src/utils/pdfThumbnail.ts": "Placeholder utility for PDF thumbnail generation; currently returns null and requires PDF.js integration for full implementation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular query strings and hash-based routing. Includes functions to persist parameters across navigation and clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom Van Gogh-inspired color palette using OKLCH color space, extended spacing, custom fonts (Inter and Crimson Text), and Van Gogh-themed glow shadows. Includes dark mode support and typography/animation plugins.",
  "project_state.json": "Project state tracking document for a Van Gogh-inspired book management web app with Internet Identity authentication. Tracks completed features including landing page, routing, theme persistence, logout/delete account flows, and modal overlays."
}