{
  "backend/main.mo": "Main Motoko actor implementing a book library platform with user profiles, book submissions/approvals, reading progress tracking, bookmarks, ratings, edit requests, genre preferences, and role-based access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Van Gogh-inspired homepage design, main menu options, secondary navigation, mood-based recommendations, trending books, and favorites functionality with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, pages, hooks, and utilities including Van Gogh theming, authentication, book management, favorites, ratings, PDF upload, and mobile-responsive layouts.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'THE HOUSE OF VIGILANTES', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup defining routes for home, browse, book detail, admin, upload, my books, admin review, and favorites pages, wrapped in ThemeProvider with Navigation, ProfileSetupModal, Footer, and Toaster components.",
  "frontend/src/components/BookCarousel.tsx": "Reusable horizontal scrolling carousel component with left/right navigation buttons, loading skeleton states, empty message support, and responsive design for displaying book collections.",
  "frontend/src/components/BookForm.tsx": "A dialog form component for creating, editing, or submitting books with fields for title, author, cover image, description, publication year, ISBN, genre, page count, and PDF upload. Includes PDF file handling via usePdfUpload hook and form validation.",
  "frontend/src/components/BookGrid.tsx": "Displays a responsive grid of book cards with cover images, titles, authors, genres, star ratings, and bookmark indicators. Shows admin-specific approval status badges and handles empty state.",
  "frontend/src/components/LoginButton.tsx": "A button component that toggles between login and logout states using Internet Identity authentication. Handles loading states and clears query cache on logout.",
  "frontend/src/components/MoodFilterChips.tsx": "Renders a collection of clickable mood filter badges with emojis that toggle selection state for filtering content by mood.",
  "frontend/src/components/Navigation.tsx": "Main navigation header with logo, links to Collection, Browse, Upload, My Books, Favorites, and Admin pages. Includes responsive mobile menu via Sheet component and conditional rendering based on authentication and admin status.",
  "frontend/src/components/PdfViewer.tsx": "A card component that displays a PDF in an iframe with controls to download the PDF or open it in a new tab.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts authenticated users without a profile to enter their name on first login, automatically showing when profile is null.",
  "frontend/src/components/RecommendationCard.tsx": "A specialized book card component for displaying personalized recommendations with a 'For You' badge and recommendation reason text.",
  "frontend/src/components/RequestMoreEditsDialog.tsx": "Dialog component that allows users to request additional edit permissions for a book after exhausting their edit count, with an optional message field.",
  "frontend/src/components/StarRating.tsx": "Star rating component that displays 1-5 stars with optional interactivity, hover effects, and review count display.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, initializing it with the user's identity and admin token, and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useMoodFilter.ts": "Hook for managing mood-based filtering that converts selected moods to corresponding book genres.",
  "frontend/src/hooks/usePdfUpload.ts": "Hook managing PDF file upload state including validation (PDF format, 1GB max), drag-and-drop handling, and conversion to Uint8Array.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including books CRUD, user profiles, submissions, ratings, reading progress, and admin functions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom literary-themed color palettes (warm earth tones, Starry Night, Van Gogh inspired) for light and dark modes, plus typography utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page for managing books, allowing authenticated admins to view all books, edit book details, delete books, and see approval status badges. Includes authentication and authorization checks with loading states.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin review page for approving or rejecting pending book submissions, with a rejection dialog that requires a reason. Includes authentication checks and displays pending submissions in a list.",
  "frontend/src/pages/BookDetailPage.tsx": "Detailed book view page showing book information, PDF viewer, reading progress tracking, bookmark functionality, and star rating system. Allows authenticated users to update progress, rate books, and toggle favorites.",
  "frontend/src/pages/BrowseBooksPage.tsx": "Main browsing page displaying all approved books with filtering by genre, author search, and mood-based filtering. Includes a hero section and grid layout with clear filter functionality.",
  "frontend/src/pages/FavoritesPage.tsx": "User favorites page displaying bookmarked books in a grid layout. Requires authentication and shows empty state with call-to-action when no favorites exist.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with Van Gogh-themed hero section, mood-based book filtering, and three primary navigation options (Browse Books, Upload Book, My Books). Displays trending books, personalized recommendations, and mood-filtered book grids with expandable sections.",
  "frontend/src/pages/MyBooksPage.tsx": "User's personal book management page showing submitted books with approval status badges (pending/approved/rejected). Provides edit, delete, and request-more-edits functionality with confirmation dialogs and form modals.",
  "frontend/src/pages/PersonalizedHomePage.tsx": "Personalized dashboard displaying mood-based book discovery, AI-powered recommendations, trending books, and recently added books. Features mood filter chips and book carousels for each section.",
  "frontend/src/pages/UploadBookPage.tsx": "Book submission page with authentication check, user profile validation, submission guidelines, and a success confirmation screen. Uses BookForm component for data entry and handles submission to admin approval queue.",
  "frontend/src/utils/moodMappings.ts": "Defines mood-to-genre mappings with 9 mood types (Happy, Exciting, Inspiring, etc.) and provides utility functions to get genres for selected moods and mood emojis.",
  "frontend/src/utils/pdfThumbnail.ts": "Placeholder utility for PDF thumbnail generation that currently returns null, intended for future PDF.js integration.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both standard query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens and functions to extract, store, retrieve, and clear URL parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including Van Gogh-inspired colors (yellow, blue, green, orange), starry theme colors, custom shadows (book, starry-glow, vangogh-glow), border radii, and font families (Crimson Text, Inter). Includes plugins for typography, container queries, and animations with OKLCH color space support.",
  "project_state.json": "Project state document tracking a book platform with Van Gogh-inspired homepage featuring personalized recommendations, mood-based browsing, and library management. Lists six completed features including background image generation, unified HomePage component, main/secondary menus, and typography styling."
}