{
  "backend/main.mo": "Main Motoko actor implementing a book collection system with user profiles, book submissions requiring admin approval, role-based access control (user/admin), and blob storage integration. Includes CRUD operations for books, approval workflow with pending/approved/rejected statuses, edit count limits (3 edits per book), and ISBN-based book identification.",
  "feature_evidence.json": "Feature evidence report documenting three completed branding changes: updating Navigation component text, HomePage hero title, and browser page title from 'Starry Night Experience' to 'THE HOUSE OF VIGILANTES', with high confidence test IDs REQ-25, REQ-26, and REQ-27.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing a book collection app with Van Gogh-inspired 'House of Vigilantes' theme, featuring user authentication, book submission/approval workflow, admin review system, profile management, and custom Starry Night color palette with flowing animations.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light/dark themes, including sidebar, chart, and UI component colors with grayscale values and minimal saturation.",
  "frontend/index.html": "HTML entry point with page title 'THE HOUSE OF VIGILANTES' and root div mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for home, book detail, admin, upload, my books, and admin review pages, wrapped in ThemeProvider with Navigation, ProfileSetupModal, Footer (including caffeine.ai attribution), and Toaster components.",
  "frontend/src/components/BookForm.tsx": "Reusable dialog form component for creating, editing, or submitting books with validation for required fields (title, author), edit count tracking with 3-edit limit warnings, and support for all book properties including optional ISBN field.",
  "frontend/src/components/BookGrid.tsx": "Responsive grid component displaying book cards with cover images, titles, authors, and approval status badges (pending/rejected) visible only to admins, with hover effects and navigation links to book detail pages.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/Navigation.tsx": "Main navigation header component that displays site branding, navigation links (Collection, Upload Book, My Books, Admin), and a login button. Conditionally shows links based on authentication status and admin privileges.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Automatically opens when user is logged in but has no profile, and saves the profile using the backend actor.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state. Initializes access control with admin token from URL params and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication. Manages login state, identity persistence, and provides login/logout functionality using the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including books, user profiles, submissions, and admin operations. Each hook uses the actor from useActor and manages query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palettes including literary warm earth tones and a \"Starry Night\" theme. Defines CSS variables for light/dark modes and utility classes for typography and colors.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context before rendering the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing books with edit and delete functionality. Checks admin privileges, displays book list with status badges, and provides dialogs for editing books and confirming deletions.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin page for reviewing pending book submissions with approve/reject functionality, including rejection reason dialog and admin access control.",
  "frontend/src/pages/BookDetailPage.tsx": "Displays detailed information about a single book including cover image, title, author, and publication details with access control based on approval status and user permissions.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a Starry Night hero section with van Gogh artwork description and a grid display of all books in the collection.",
  "frontend/src/pages/MyBooksPage.tsx": "User dashboard for managing their uploaded books with edit (limited to 3 times) and delete functionality, showing approval status badges for each book.",
  "frontend/src/pages/UploadBookPage.tsx": "Book submission page with authentication and profile checks, allowing users to upload new books for admin approval with submission guidelines.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system with CSS variables, custom fonts (Crimson Text, Inter), book-themed shadows, starry effects, and animation keyframes for accordions.",
  "project_state.json": "Project state file documenting a curated book platform with multi-role system (admin and authors), two-stage approval workflow, edit limits (3 per book), and tracking of implemented features including homepage, book details, admin interface, and upload functionality."
}