{
  "backend/main.mo": "Main Motoko actor implementing a book library platform with user authentication, book management (upload, approval, editing), reading progress tracking, ratings, bookmarks, recommendations, and admin features including analytics, curated collections, and content moderation.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including admin dashboard analytics, curated collections management, moderation dashboard, and author/series manager integration with their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, pages, hooks, and utilities for the Van Gogh-themed book platform with authentication, book management, admin features, and social functionality.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with light/dark theme variables for Van Gogh-inspired design including custom properties for background, foreground, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with page title \"THE HOUSE OF VIGILANTES\" and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for landing, browse, book details, upload, admin pages (analytics, collections, moderation), social features, discussions, and collections, wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with sidebar, header containing theme toggle and logout button with fade transition, and footer, managing authentication state and logout flow with query cache clearing.",
  "frontend/src/components/AuthorAnalytics.tsx": "Displays analytics dashboard for a selected book including views, reads, favorites, ratings, completion rate, and trending position with mock data. Shows engagement trends chart and empty state when no book is selected.",
  "frontend/src/components/AuthorBookManager.tsx": "Manages author's book collection with CRUD operations including add, edit, delete, and view analytics functionality. Displays books in a grid with action buttons and includes confirmation dialogs for destructive actions.",
  "frontend/src/components/AuthorReaderInteraction.tsx": "Shows reader comments/feedback and top fans section for authors using mock data. Includes reply and mark-as-read functionality for comments and displays fan engagement metrics.",
  "frontend/src/components/AuthorSeriesManager.tsx": "Frontend-only series management component allowing authors to create, edit, and delete book series with reading order. Uses local state until backend series support is implemented.",
  "frontend/src/components/AuthPrompt.tsx": "Modal dialog component prompting unauthenticated users to log in with Internet Identity, featuring Van Gogh-themed styling and customizable message prop.",
  "frontend/src/components/BookCarousel.tsx": "Horizontal scrolling carousel component for displaying books with navigation arrows, loading states, and click-to-navigate functionality. Shows book covers with genre badges and handles empty states.",
  "frontend/src/components/BookForm.tsx": "A comprehensive form component for creating, editing, and submitting books with fields for metadata (title, author, genre, ISBN, etc.), PDF upload functionality via usePdfUpload hook, and validation logic. Supports three modes: create, edit, and submit with different approval statuses.",
  "frontend/src/components/BookGrid.tsx": "Displays a responsive grid of book cards with cover images, titles, authors, genres, ratings, and bookmark indicators. Shows admin-specific approval status badges and handles empty states.",
  "frontend/src/components/DashboardStatsCard.tsx": "A reusable card component for displaying dashboard statistics with an icon, label, value, and optional trend indicator, styled with Van Gogh theme colors.",
  "frontend/src/components/DeleteAccountModal.tsx": "A confirmation modal for account deletion with warning icon, descriptive text about permanent data loss, and cancel/confirm action buttons with loading state support.",
  "frontend/src/components/EditAuthorProfileDialog.tsx": "A dialog form for authors to edit their profile including name, bio, website, and social media links (Twitter, Facebook, Instagram) with URL validation. Stores extended profile data in localStorage until backend support is added.",
  "frontend/src/components/EditProfileDialog.tsx": "A simple dialog form for users to edit their profile name, using the useSaveCallerUserProfile mutation hook to persist changes to the backend.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information and a \"Built with caffeine.ai\" attribution link with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "A hero section with gradient background, welcome text, and a search bar that accepts queries and triggers an onSearch callback for book/author/genre searches.",
  "frontend/src/components/LoginButton.tsx": "An authentication button that toggles between login and logout states using Internet Identity, with loading states and error handling that clears the query cache on logout.",
  "frontend/src/components/MoodCarousel.tsx": "A horizontal scrollable carousel component that displays books grouped by mood with navigation arrows, book cards showing cover images, titles, authors, and mood badges.",
  "frontend/src/components/MoodFilterChips.tsx": "Displays a set of clickable mood filter badges with emojis that can be toggled on/off for filtering content by mood.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar component with logo, main navigation links, login button, and responsive mobile menu that collapses on smaller screens.",
  "frontend/src/components/PdfViewer.tsx": "Embeds and displays PDF documents in an iframe with options to download or open in a new tab.",
  "frontend/src/components/PlaceholderAuthDialog.tsx": "Empty placeholder component file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name for initial profile setup.",
  "frontend/src/components/RecommendationCard.tsx": "Displays a personalized book recommendation card with cover image, title, author, and AI-generated reason for the recommendation.",
  "frontend/src/components/RequestMoreEditsDialog.tsx": "Dialog that allows users who have exhausted their edit quota to request additional editing permissions with an optional message.",
  "frontend/src/components/Sidebar.tsx": "Collapsible left sidebar navigation with icons and labels for main app sections, including admin-only items for authorized users.",
  "frontend/src/components/StarRating.tsx": "A reusable star rating component that displays 1-5 stars with support for interactive mode (clickable), hover effects, different sizes (sm/md/lg), and optional rating count display.",
  "frontend/src/components/ThemeToggle.tsx": "A theme toggle button component that switches between light and dark modes using next-themes, persists preference to localStorage, and displays sun/moon icons with Van Gogh-themed styling.",
  "frontend/src/components/TrendingSection.tsx": "Displays a ranked list of trending books with cover images, ratings, and metadata in card format with Van Gogh-themed styling and click handlers.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMoodFilter.ts": "Custom hook for managing mood-based book filtering, allowing users to select/deselect moods and automatically mapping them to corresponding book genres.",
  "frontend/src/hooks/usePdfUpload.ts": "Manages PDF file upload state and validation, handling file selection, drag-and-drop, size/type validation (max 1GB), and converting files to Uint8Array for processing.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all book-related operations including fetching books (all, by ISBN, by author, user's books), submitting/updating/deleting books, managing user profiles, reading progress, ratings, and recommendations with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a Van Gogh-inspired color palette for light and dark modes, custom CSS animations (swirl, pulse, float, fade), and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard displaying site-wide metrics including total books, users, genre distribution, and top 10 most viewed books with trending statistics.",
  "frontend/src/pages/AdminCollectionsPage.tsx": "Admin page placeholder for curated collections management feature, currently showing a \"coming soon\" message as backend support is being implemented.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin page placeholder for content moderation feature, currently showing a \"coming soon\" message for reviewing flagged content.",
  "frontend/src/pages/AdminPage.tsx": "Main admin panel for managing all books with edit and delete functionality, displaying book status badges (approved/pending/rejected) and requiring admin authentication.",
  "frontend/src/pages/AdminReviewPage.tsx": "Admin page for reviewing pending book submissions with approve/reject actions, including a dialog for entering rejection reasons.",
  "frontend/src/pages/AuthorDashboardPage.tsx": "Author dashboard page with tabs for profile editing, book management, analytics, series management, and reader interactions; includes authentication checks, account deletion functionality, and loading/error states.",
  "frontend/src/pages/AuthorProfilePage.tsx": "Public author profile page displaying author bio, social links, and their published books using BookGrid component; includes mock author data with placeholders for website and social media.",
  "frontend/src/pages/AuthorsPage.tsx": "Lists all authors with book counts extracted from approved books; displays authors in a grid with skeleton loading states and handles navigation to browse page.",
  "frontend/src/pages/BookDetailPage.tsx": "Detailed book view page with PDF viewer, rating system, bookmark functionality, and reading progress tracking; includes authentication prompts for guest users and view tracking.",
  "frontend/src/pages/BrowseBooksPage.tsx": "Main book browsing page with mood-based filtering, genre and author dropdowns, and displays approved books in a grid; includes filter chips and clear all filters functionality.",
  "frontend/src/pages/CollectionDetailPage.tsx": "Placeholder page for individual collection details with back navigation; displays 'Coming Soon' message indicating backend implementation is pending.",
  "frontend/src/pages/CollectionsPage.tsx": "Placeholder page for curated book collections feature; displays 'Coming Soon' message with description of planned themed collections and mood-based spotlights.",
  "frontend/src/pages/DiscussionsPage.tsx": "Placeholder page for book discussion threads feature; displays 'Coming Soon' message indicating backend support for discussion functionality is being implemented.",
  "frontend/src/pages/FavoritesPage.tsx": "Displays the user's bookmarked/favorite books in a grid layout with authentication checks. Shows a login prompt for unauthenticated users and handles loading/error states for the bookmarked books query.",
  "frontend/src/pages/HomePage.tsx": "Landing page for unauthenticated users featuring a Van Gogh-inspired full-screen background with theme toggle. Redirects authenticated users to the personalized home page (/home).",
  "frontend/src/pages/LandingPage.tsx": "Alternative landing page with Van Gogh-themed background, theme toggle, and Internet Identity login button. Redirects authenticated users to /home and displays 'The House of Vigilantes' branding.",
  "frontend/src/pages/MyBooksPage.tsx": "Displays books uploaded by the authenticated user with edit, delete, and request-more-edits functionality. Shows book status badges (pending, approved, rejected) and requires authentication to access.",
  "frontend/src/pages/PersonalizedHomePage.tsx": "Main authenticated home page displaying personalized recommendations, continue reading, recently viewed, mood-based book carousels, and trending books. Redirects unauthenticated users to the landing page.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing reading statistics (books read, bookmarks, ratings), genre preferences, and profile edit functionality. Requires authentication and displays an auth prompt for logged-out users.",
  "frontend/src/pages/SocialPage.tsx": "Displays a placeholder page for social features with authentication check; shows login prompt for unauthenticated users and a 'coming soon' message for authenticated users.",
  "frontend/src/pages/ThreadDetailPage.tsx": "Renders a placeholder page for discussion thread details with a back button to discussions list and a 'coming soon' message.",
  "frontend/src/pages/UploadBookPage.tsx": "Provides a book upload interface with submission guidelines, authentication check, and a form for submitting books; handles book submission via mutation hook.",
  "frontend/src/utils/mockAnalyticsData.ts": "Generates consistent mock analytics data (views, reads, favorites, trends, completion rates) for books based on ISBN seed values.",
  "frontend/src/utils/mockBookData.ts": "Defines mock book data organized by mood categories (Happy, Melancholic, Adventurous) with generated cover images and book metadata.",
  "frontend/src/utils/mockReaderData.ts": "Provides mock reader engagement data including comments and top fans with engagement scores for testing purposes.",
  "frontend/src/utils/moodMappings.ts": "Maps mood types to book genres and provides utility functions for mood-to-genre conversion and mood emoji display.",
  "frontend/src/utils/pdfThumbnail.ts": "Placeholder function for PDF thumbnail generation that currently returns null, intended for future PDF.js integration.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (including Van Gogh theme colors), border radius, fonts, shadows, and spacing with dark mode support.",
  "project_state.json": "Project state file documenting a Next-gen book platform with Van Gogh-inspired design, featuring admin dashboards, author analytics, mood-based recommendations, social features, and series navigation. Implements phased rollout with Internet Identity authentication, light/dark mode, and post-and-refresh pattern for social interactions."
}