{
  "kind": "build_request",
  "title": "Build comprehensive sidebar navigation with full UI pages (Stage 1)",
  "projectName": "The House of Vigilantes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the existing sidebar navigation with a comprehensive design including navigation items: Home, Books, Authors, Trending, Upload Book, and Profile. Maintain the collapsible/expandable behavior with smooth transitions and dynamic content resizing that already exists in Version 24.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Replace existing sidebar with full navigation: Home, Books, Authors, Trending, Upload Book, Profile"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar contains all six navigation items: Home, Books, Authors, Trending, Upload Book, Profile",
        "Collapsible/expandable behavior works smoothly with content resizing",
        "Navigation items link to their respective pages",
        "Sidebar maintains localStorage persistence for collapsed/expanded state"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the sidebar styling to use blue, gold, and white as primary colors with Van Gogh-inspired subtle textures. Ensure light/dark mode support is maintained and the sidebar adapts seamlessly with the page theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Blue, gold, and white color scheme with Van Gogh-inspired textures",
          "Light/dark mode support with persistent localStorage preferences"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar uses blue, gold, and white colors consistently",
        "Van Gogh-inspired textures are applied subtly to the sidebar",
        "Light and dark mode both render correctly with appropriate color adjustments",
        "Theme preference persists across sessions via localStorage"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create a Home page that displays a hero section with personalized book recommendations and trending books. The page content should expand to fill available space when the sidebar collapses. Use placeholder data for recommendations initially.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Home page with hero section and recommendation areas",
          "Expands the page content to fill available space when sidebar collapses"
        ]
      },
      "acceptanceCriteria": [
        "Home page displays a hero section at the top",
        "Personalized recommendations section shows placeholder book cards",
        "Trending books section displays placeholder books",
        "Page content dynamically resizes when sidebar state changes",
        "Navigation from sidebar 'Home' item successfully routes to this page"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Build a Books browse page with advanced search input, filter dropdowns for genres and authors, and sorting options. Display books in mood-based carousels with trending sections and personalized book cards. Use placeholder data for the initial implementation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Books browse page with search, filters, and mood-based carousels",
          "Features advanced search, filters, and sorting options"
        ]
      },
      "acceptanceCriteria": [
        "Page includes a search input field for books",
        "Filter dropdowns for genre and author selection are functional",
        "Sorting options (e.g., by rating, title, date) are available",
        "Books display in mood-based horizontal carousels",
        "Trending section highlights popular books",
        "Navigation from sidebar 'Books' item routes to this page"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create an Authors list page that displays all authors with avatars and brief bios. Each author entry should be clickable and navigate to their public profile page. Use placeholder data for author avatars, bios, and profiles initially.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Authors list page with avatars and bios",
          "Clicking an author opens their public profile"
        ]
      },
      "acceptanceCriteria": [
        "Page displays a list or grid of authors",
        "Each author shows an avatar image and brief bio",
        "Clicking an author navigates to their profile page",
        "Navigation from sidebar 'Authors' item routes to this page",
        "Uses placeholder data for all author information"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Build a Trending page that displays trending or popular books and collections. Highlight currently popular moods, genres, and top-rated books using placeholder data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Trending page for popular books and collections",
          "Highlights currently popular moods, genres, and top-rated books"
        ]
      },
      "acceptanceCriteria": [
        "Page displays a section for trending books",
        "Popular moods are highlighted with visual indicators",
        "Top-rated books section shows highly-rated placeholder books",
        "Genre-based trending sections are visible",
        "Navigation from sidebar 'Trending' item routes to this page"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Create an Upload Book page or modal with a form for book file upload, metadata entry (title, author, description, genre), cover image upload, and series management fields. Display the form in a semi-transparent modal overlay with blur effects. Make it accessible to all users for now (authentication and author-only access will be added in Stage 3).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Upload Book page/modal (UI only, accessible to all for now)",
          "Supports book file upload, metadata entry, cover image, and series management"
        ]
      },
      "acceptanceCriteria": [
        "Upload Book form is accessible from sidebar navigation",
        "Form includes fields for: book file upload, title, author, description, genre, cover image",
        "Series management fields (series name, book order) are included",
        "Modal overlay has semi-transparent background with blur effect",
        "Form has submit and cancel buttons",
        "Currently accessible to all users without authentication checks"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Build a Profile page that displays the user's avatar, name, bio, reading lists, and favorites. Include visible UI buttons for 'Log Out' and 'Delete Account' account actions. The Log Out button should clear the session and redirect to the landing page. The Delete Account button should open a confirmation modal and, upon confirmation, redirect to the landing page. Use placeholder data for profile information initially.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Profile page with reading lists, favorites, and account actions (Log Out/Delete Account buttons)",
          "Log Out / Sign Out: clears session, redirects to landing page",
          "Delete Account: confirmation modal, deletes all user data, redirects to landing page"
        ]
      },
      "acceptanceCriteria": [
        "Profile page displays user avatar, name, and bio",
        "Reading lists section shows placeholder books",
        "Favorites section displays bookmarked books",
        "Log Out button is visible and functional (clears session, redirects to landing page)",
        "Delete Account button opens a confirmation modal",
        "Delete Account confirmation modal has cancel and confirm buttons",
        "Upon Delete Account confirmation, user is redirected to landing page",
        "Navigation from sidebar 'Profile' item routes to this page"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add social feature UI elements throughout the platform including followers/following counters, review sections on book pages, and share functionality buttons. Display these elements with placeholder data and non-functional interactions for now (backend integration will come in Stage 2).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Social feature UI elements (followers/following counters, review sections, share buttons)",
          "Followers / Following: track favorite authors or users",
          "Reviews & Ratings: integrated into book pages and carousels"
        ]
      },
      "acceptanceCriteria": [
        "Followers/following counters appear on profile and author pages with placeholder numbers",
        "Book detail pages include a reviews section showing placeholder reviews",
        "Share buttons are visible on book pages and collections",
        "All social elements use placeholder data",
        "Interactions are visual only (no backend calls yet)"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure the sidebar and all new pages are fully responsive across desktop, tablet, and mobile devices. On mobile, the sidebar should collapse into a hamburger menu or overlay that can be toggled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Fully responsive across desktop, tablet, and mobile",
          "Responsive design for desktop, tablet, and mobile"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar renders correctly on desktop, tablet, and mobile screens",
        "On mobile, sidebar collapses into a hamburger menu or overlay",
        "All new pages (Home, Books, Authors, Trending, Upload Book, Profile) are responsive",
        "Content adjusts appropriately for different screen sizes",
        "Touch interactions work smoothly on mobile devices"
      ]
    }
  ],
  "constraints": [
    "Do not implement backend data models or CRUD operations in this build (Stage 2)",
    "Do not implement Internet Identity authentication or role-based access control in this build (Stage 3)",
    "Use placeholder/mock data for all books, authors, reviews, followers, and social features",
    "Maintain the existing collapsible sidebar behavior and localStorage persistence from Version 24",
    "Follow the Van Gogh-inspired design theme with blue, gold, and white colors",
    "Keep all pages accessible to all users regardless of authentication status for now"
  ],
  "nonGoals": [
    "Backend Motoko data models for Books, Authors, Users, Reviews, Followers",
    "CRUD operations and data persistence",
    "Internet Identity authentication implementation",
    "Role-based access control (reader vs author)",
    "Functional social features (actual following, reviewing, sharing)",
    "Real data integration with backend",
    "Author-only restrictions on Upload Book page",
    "Actual account deletion backend logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}