{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Build comprehensive sidebar navigation with full UI pages (Stage 1)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the existing sidebar navigation with a comprehensive design including navigation items: Home, Books, Authors, Trending, Upload Book, and Profile with collapsible behavior",
      "acceptanceCriteria": [
        "Sidebar contains all six navigation items: Home, Books, Authors, Trending, Upload Book, Profile",
        "Collapsible/expandable behavior works smoothly with content resizing",
        "Navigation items link to their respective pages",
        "Sidebar maintains localStorage persistence for collapsed/expanded state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Sidebar.tsx",
          "operation": "modify",
          "description": "Update the sidebar component to include all six navigation items (Home, Books, Authors, Trending, Upload Book, Profile) with proper routing. Ensure the collapsible behavior using useSidebarState hook is maintained. Remove or consolidate any existing navigation items that don't match the required set. Verify that localStorage persistence for the collapsed/expanded state continues to work as expected from Version 24."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the sidebar styling to use blue, gold, and white as primary colors with Van Gogh-inspired subtle textures and light/dark mode support",
      "acceptanceCriteria": [
        "Sidebar uses blue, gold, and white colors consistently",
        "Van Gogh-inspired textures are applied subtly to the sidebar",
        "Light and dark mode both render correctly with appropriate color adjustments",
        "Theme preference persists across sessions via localStorage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Sidebar.tsx",
          "operation": "modify",
          "description": "Apply Van Gogh-inspired styling with blue, gold, and white color scheme to the sidebar component. Use Tailwind classes that reference the existing OKLCH color variables defined in index.css (e.g., sidebar-bg, sidebar-border, primary colors). Add subtle texture effects using CSS patterns or background gradients. Ensure all styling adapts properly for both light and dark modes by leveraging the existing theme system."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Review and adjust the existing Van Gogh-inspired color palette CSS variables for the sidebar to ensure blue, gold, and white are properly represented in both light and dark modes. Add any missing color variables needed for the sidebar styling. Ensure the theme toggle continues to work with localStorage persistence as already implemented."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Verify that the Tailwind configuration extends the OKLCH color system to include all necessary sidebar color tokens (blue, gold, white variants). Add any custom utility classes needed for Van Gogh-inspired textures or sidebar-specific styling patterns."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create a Home page that displays a hero section with personalized book recommendations and trending books with dynamic content resizing",
      "acceptanceCriteria": [
        "Home page displays a hero section at the top",
        "Personalized recommendations section shows placeholder book cards",
        "Trending books section displays placeholder books",
        "Page content dynamically resizes when sidebar state changes",
        "Navigation from sidebar 'Home' item successfully routes to this page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PersonalizedHomePage.tsx",
          "operation": "modify",
          "description": "Update the existing PersonalizedHomePage to include a hero section at the top with welcoming content. Ensure the personalized recommendations section displays placeholder book cards using the existing RecommendationCard component. Add or enhance the trending books section using the TrendingSection component with placeholder data. Verify that the page content dynamically adjusts its width/margin when the sidebar collapses or expands (this should already be handled by AppLayout). Ensure this page is accessible via the /home route."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the /home route is properly configured to render PersonalizedHomePage and that it's accessible from the sidebar Home navigation item. Ensure route guards redirect unauthenticated users appropriately if needed."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Build a Books browse page with advanced search input, filter dropdowns for genres and authors, sorting options, and mood-based carousels with placeholder data",
      "acceptanceCriteria": [
        "Page includes a search input field for books",
        "Filter dropdowns for genre and author selection are functional",
        "Sorting options (e.g., by rating, title, date) are available",
        "Books display in mood-based horizontal carousels",
        "Trending section highlights popular books",
        "Navigation from sidebar 'Books' item routes to this page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BrowseBooksPage.tsx",
          "operation": "modify",
          "description": "Enhance the existing BrowseBooksPage to include an advanced search input field at the top for book searches. Add filter dropdowns for genre and author selection with proper state management. Implement sorting options (by rating, title, publication date) with a dropdown or button group. Ensure mood-based carousels are displayed using the MoodCarousel component with placeholder data. Add a trending section that highlights popular books using the TrendingSection component. Verify that all filters, search, and sorting work together cohesively with placeholder data."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the /browse route is properly configured to render BrowseBooksPage and that it's accessible from the sidebar Books navigation item."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create an Authors list page that displays all authors with avatars and brief bios, with clickable entries navigating to public profile pages",
      "acceptanceCriteria": [
        "Page displays a list or grid of authors",
        "Each author shows an avatar image and brief bio",
        "Clicking an author navigates to their profile page",
        "Navigation from sidebar 'Authors' item routes to this page",
        "Uses placeholder data for all author information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthorsPage.tsx",
          "operation": "modify",
          "description": "Update the existing AuthorsPage to display authors in a grid layout with placeholder avatar images and brief bio text for each author. Make each author entry clickable, linking to their public profile page at /author/:authorName. Use placeholder data for author information (avatars, bios) alongside the existing logic that extracts author names from books. Ensure the page is responsive and accessible via the /authors route from the sidebar."
        },
        {
          "path": "frontend/src/pages/AuthorProfilePage.tsx",
          "operation": "modify",
          "description": "Verify that the AuthorProfilePage properly displays the public profile for an author, including their avatar, bio, social links, and books. Ensure placeholder data is used for author details that aren't currently stored in the backend. Confirm navigation from AuthorsPage works correctly."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the /authors route renders AuthorsPage and the /author/:authorName route renders AuthorProfilePage, both accessible from sidebar navigation."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Build a Trending page that displays trending or popular books and collections, highlighting currently popular moods, genres, and top-rated books",
      "acceptanceCriteria": [
        "Page displays a section for trending books",
        "Popular moods are highlighted with visual indicators",
        "Top-rated books section shows highly-rated placeholder books",
        "Genre-based trending sections are visible",
        "Navigation from sidebar 'Trending' item routes to this page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TrendingPage.tsx",
          "operation": "create",
          "description": "Create a new TrendingPage component that displays trending and popular books. Include a section for trending books using the TrendingSection component with placeholder data. Add a popular moods section that highlights currently popular moods with visual indicators (emoji badges or colored chips). Create a top-rated books section displaying highly-rated placeholder books in a grid or carousel format. Add genre-based trending sections that showcase popular books by genre. Use placeholder data for all content. Ensure the page is responsive and follows the Van Gogh-inspired design theme."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for /trending that renders the TrendingPage component. Ensure it's accessible from the sidebar Trending navigation item and properly integrated into the router configuration."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create an Upload Book page or modal with a form for book file upload, metadata entry, cover image upload, and series management fields, accessible to all users",
      "acceptanceCriteria": [
        "Upload Book form is accessible from sidebar navigation",
        "Form includes fields for: book file upload, title, author, description, genre, cover image",
        "Series management fields (series name, book order) are included",
        "Modal overlay has semi-transparent background with blur effect",
        "Form has submit and cancel buttons",
        "Currently accessible to all users without authentication checks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UploadBookPage.tsx",
          "operation": "modify",
          "description": "Update the existing UploadBookPage to ensure it includes all required form fields: book file upload (PDF), title, author, description, genre, cover image upload, series name, and book order fields. The page already has a dialog-based BookForm component; verify it includes series management fields. Ensure the form is presented with a semi-transparent background and blur effect (may be handled by the dialog component styling). Add submit and cancel buttons if not already present. Remove any authentication checks or restrictions so the form is accessible to all users for now (authentication will be added in Stage 3)."
        },
        {
          "path": "frontend/src/components/BookForm.tsx",
          "operation": "modify",
          "description": "Verify and enhance the BookForm component to include all required fields: PDF file upload (already using usePdfUpload hook), title, author, description, genre, cover image upload, series name, and book order. Ensure the form dialog has proper styling with semi-transparent overlay and blur effects matching the Van Gogh-inspired theme. Add validation for all fields and clear submit/cancel button functionality."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the /upload route is properly configured to render UploadBookPage and that it's accessible from the sidebar Upload Book navigation item without authentication restrictions."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Build a Profile page that displays user avatar, name, bio, reading lists, and favorites with Log Out and Delete Account buttons",
      "acceptanceCriteria": [
        "Profile page displays user avatar, name, and bio",
        "Reading lists section shows placeholder books",
        "Favorites section displays bookmarked books",
        "Log Out button is visible and functional (clears session, redirects to landing page)",
        "Delete Account button opens a confirmation modal",
        "Delete Account confirmation modal has cancel and confirm buttons",
        "Upon Delete Account confirmation, user is redirected to landing page",
        "Navigation from sidebar 'Profile' item routes to this page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Update the existing ProfilePage to display user avatar (placeholder image), name, and bio. Add a reading lists section that shows placeholder books (can use a carousel or grid of book cards). Ensure the favorites section displays bookmarked books using the existing getBookmarkedBooks query. Add visible Log Out and Delete Account buttons prominently on the page. Wire the Log Out button to clear the session using the Internet Identity context and redirect to the landing page (/). Wire the Delete Account button to open the DeleteAccountModal component."
        },
        {
          "path": "frontend/src/components/DeleteAccountModal.tsx",
          "operation": "modify",
          "description": "Verify the DeleteAccountModal component has proper styling with the Van Gogh-inspired theme, a clear warning message, and cancel/confirm buttons. Ensure that upon confirmation, the modal triggers the deleteAccount mutation (or clears the session if backend deletion isn't implemented yet) and redirects to the landing page. The modal should have a semi-transparent backdrop with blur effect."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the /profile route is properly configured to render ProfilePage and that it's accessible from the sidebar Profile navigation item."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add social feature UI elements throughout the platform including followers/following counters, review sections on book pages, and share functionality buttons",
      "acceptanceCriteria": [
        "Followers/following counters appear on profile and author pages with placeholder numbers",
        "Book detail pages include a reviews section showing placeholder reviews",
        "Share buttons are visible on book pages and collections",
        "All social elements use placeholder data",
        "Interactions are visual only (no backend calls yet)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add followers/following counters to the ProfilePage header section with placeholder numbers (e.g., '234 Followers', '89 Following'). Style these counters consistently with the Van Gogh-inspired theme. Ensure they are prominently displayed near the user's avatar and name."
        },
        {
          "path": "frontend/src/pages/AuthorProfilePage.tsx",
          "operation": "modify",
          "description": "Add followers/following counters to the AuthorProfilePage with placeholder numbers. Display these counters near the author's bio and avatar. Use consistent styling with the ProfilePage counters."
        },
        {
          "path": "frontend/src/pages/BookDetailPage.tsx",
          "operation": "modify",
          "description": "Add a reviews section to the BookDetailPage that displays placeholder reviews with mock review text, star ratings, usernames, and timestamps. Include a share button (with icons for social media platforms) that is visible but non-functional for now. Position the reviews section below the book description and above or alongside the PDF viewer. Use placeholder data for all review content."
        },
        {
          "path": "frontend/src/pages/CollectionDetailPage.tsx",
          "operation": "modify",
          "description": "Add share buttons to the CollectionDetailPage that are visible but non-functional. Include social media icons (Twitter, Facebook, etc.) styled consistently with the Van Gogh theme. Display a placeholder message indicating that collection sharing will be available once backend support is added."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Ensure the sidebar and all new pages are fully responsive across desktop, tablet, and mobile devices with hamburger menu on mobile",
      "acceptanceCriteria": [
        "Sidebar renders correctly on desktop, tablet, and mobile screens",
        "On mobile, sidebar collapses into a hamburger menu or overlay",
        "All new pages (Home, Books, Authors, Trending, Upload Book, Profile) are responsive",
        "Content adjusts appropriately for different screen sizes",
        "Touch interactions work smoothly on mobile devices"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Sidebar.tsx",
          "operation": "modify",
          "description": "Ensure the Sidebar component is fully responsive. On mobile screens (below tablet breakpoint), the sidebar should either collapse into a hamburger menu or display as an overlay that can be toggled. Use Tailwind responsive classes (e.g., md:, lg:) to adjust layout and visibility. Verify that touch interactions work smoothly and the mobile menu can be opened and closed easily. The collapsed/expanded state should still persist via localStorage across all devices."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Verify that AppLayout properly handles responsive layout adjustments for the sidebar and main content area. Ensure the mobile menu toggle button in the header is functional and the content area adjusts margins appropriately on all screen sizes. Test that the layout transitions smoothly between desktop, tablet, and mobile breakpoints."
        },
        {
          "path": "frontend/src/pages/PersonalizedHomePage.tsx",
          "operation": "modify",
          "description": "Add responsive design adjustments to PersonalizedHomePage. Ensure the hero section, recommendations, and trending sections adapt to different screen sizes using Tailwind responsive utilities. Test that carousels and grids stack or adjust properly on mobile and tablet devices."
        },
        {
          "path": "frontend/src/pages/BrowseBooksPage.tsx",
          "operation": "modify",
          "description": "Ensure BrowseBooksPage is fully responsive. Adjust the search input, filter dropdowns, sorting options, and book carousels/grids to stack or reflow appropriately on smaller screens. Use Tailwind responsive classes to optimize the layout for mobile and tablet devices."
        },
        {
          "path": "frontend/src/pages/AuthorsPage.tsx",
          "operation": "modify",
          "description": "Make AuthorsPage responsive by adjusting the author grid to show fewer columns on tablet and mobile screens. Ensure author cards remain readable and clickable on all devices."
        },
        {
          "path": "frontend/src/pages/TrendingPage.tsx",
          "operation": "modify",
          "description": "Apply responsive design patterns to TrendingPage. Ensure trending sections, mood indicators, and book grids/carousels adapt to different screen sizes. Test that all content is accessible and usable on mobile and tablet devices."
        },
        {
          "path": "frontend/src/pages/UploadBookPage.tsx",
          "operation": "modify",
          "description": "Ensure the UploadBookPage and BookForm dialog are responsive. The form should be easily usable on mobile and tablet devices with appropriate input sizing and touch-friendly controls. Verify that file upload areas work with touch interactions."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add responsive design adjustments to ProfilePage. Ensure the avatar, name, bio, reading lists, favorites, and action buttons are properly laid out on mobile and tablet screens. Use Tailwind responsive utilities to stack or reflow content as needed."
        }
      ]
    }
  ]
}