{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Van Gogh landing page with post-action redirects and theme persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new Van Gogh-inspired landing page component with Internet Identity integration and theme toggle",
      "acceptanceCriteria": [
        "Landing page displays a full-screen Van Gogh painting as background",
        "Sign Up and Log In buttons are prominently displayed and functional",
        "Light/Dark mode toggle is accessible and functional",
        "Page uses existing Van Gogh theme styling consistent with other pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "create",
          "description": "Create a new landing page component with full-screen Van Gogh painting background from frontend/public/assets/generated/landing-hero.dim_1920x1080.png. Include Sign Up and Log In buttons that use the authorization component's Internet Identity integration via useInternetIdentity hook. Add a light/dark mode toggle using ThemeToggle component. Apply Van Gogh theme styling from frontend/index.css including gradient backgrounds, OKLCH colors, and custom animations. Ensure the component is responsive and accessible."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update routing to show LandingPage for unauthenticated users and redirect authenticated users to /home",
      "acceptanceCriteria": [
        "Unauthenticated users see the landing page at root path",
        "Authenticated users are automatically redirected to /home",
        "Navigation between routes works smoothly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the root route ('/') to render LandingPage component instead of HomePage. Add authentication check using useInternetIdentity hook - if user is authenticated (identity exists), redirect to '/home'. Wire PersonalizedHomePage to the '/home' route for authenticated users. Ensure smooth navigation transitions between landing and authenticated routes. Import and register the new LandingPage component."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement theme persistence using browser localStorage",
      "acceptanceCriteria": [
        "Theme preference is saved to localStorage when user toggles light/dark mode",
        "Theme preference is loaded from localStorage on page load",
        "Theme persists after logout and page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ThemeToggle.tsx",
          "operation": "modify",
          "description": "Add localStorage persistence to the theme toggle functionality. On theme change, save the preference to localStorage using key 'theme-preference'. On component mount, load the theme preference from localStorage and apply it. Ensure the theme persists across logout, page refresh, and browser sessions. Use the existing next-themes ThemeProvider for theme management."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update Log Out button to redirect to landing page with smooth fade transition",
      "acceptanceCriteria": [
        "Log Out button clears Internet Identity session",
        "Log Out button clears query cache and frontend state",
        "User is redirected to landing page after logout",
        "Transition to landing page uses smooth fade animation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the Log Out button handler to navigate to '/' (landing page) instead of '/login' after clearing Internet Identity session and query cache. Add a smooth fade transition using CSS animation or Tailwind fade classes before navigation. Ensure the toast notification is still displayed. Keep the existing clear() and queryClient.clear() logic intact."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Add or enhance the fade-out animation class for smooth transitions when redirecting to the landing page. Define keyframes and transition timing that provides a polished user experience during logout. Ensure the animation is compatible with both light and dark themes."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update Delete Account flow to redirect to landing page with smooth fade transition",
      "acceptanceCriteria": [
        "After confirming deletion in modal, account is deleted from backend",
        "Frontend session is cleared after deletion",
        "User is redirected to landing page after deletion",
        "Transition to landing page uses smooth fade animation",
        "Success toast message is displayed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthorDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the handleDeleteAccount function to navigate to '/' (landing page) after successful account deletion instead of any other route. Add smooth fade transition before navigation using CSS animation. Ensure the function calls the deleteAccount mutation, clears Internet Identity session via clear(), clears query cache via queryClient.clear(), shows success toast, and then navigates to landing page. Maintain proper error handling."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Ensure Delete Account modal has semi-transparent overlay with blurred background",
      "acceptanceCriteria": [
        "Modal overlay has semi-transparent background",
        "Background behind modal is visually blurred or tinted",
        "Modal content remains readable against blurred background"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DeleteAccountModal.tsx",
          "operation": "modify",
          "description": "Update the modal overlay styling to include a semi-transparent backdrop with backdrop-blur effect or tinted background. Use Tailwind classes like 'backdrop-blur-sm bg-black/50' or similar to achieve readability while maintaining visual interest. Ensure the modal dialog content stands out with proper contrast and the Van Gogh theme styling is preserved."
        }
      ]
    }
  ]
}